[
    {
        "id": 1001,
        "title": "JavaScript for impatient programmers (ES2022 edition)",
        "subtitle": "This book makes JavaScript less challenging to learn for newcomers by offering a modern view that is as consistent aspossible.",
        "description": "Some advanced language features are not explained, but references to appropriate material are provided – for example, to my other JavaScript books at ExploringJS.com, which are free to read online.\nThis book deliberately focuses on the language.\nBrowser-only features, etc are not described",
        "image": "/jsbook1.png",
        "tags": ["JS", "learning", "education", "2022", "programming", "IT"],
        "price": {
            "amount": 10,
            "currency": "EUR"
        }

    },

    {
        "id": 1002,
        "title": "Eloquent JavaScript (4th edition - 2024)",
        "subtitle": "This is a book about JavaScript, programming, and the wonders of the digital. You can read it online here, or buy your own paperback copy (3rd edition).",
        "description": "Licensed under a Creative Commons attribution-noncommercial license. All code in this book may also be considered licensed under an MIT license. Illustrations by various artists: Cover by Péchane Sumi-e. Chapter illustrations by Madalina Tantareanu. Pixel art in Chapters 7 and 16 by Antonio Perdomo Pastor. Regular expression diagrams in Chapter 9 generated with regexper.com by Jeff Avallone. Game concept for Chapter 16 by Thomas Palef.",
        "image": "/jsbook2.jpg",
        "tags": ["JS", "learning", "education", "2022", "programming", "IT"],
        "price": {
            "amount": 20,
            "currency": "USD"
        }

    },
    {
        "id": 1003,
        "title": "Node Cookbook: Discover solutions, techniques, and best practices for server-side web development with Node.js 14",
        "subtitle": "A key technology for building web applications and tooling, Node.js brings JavaScript to the server enabling full-stack development in a common language.",
        "description": "This practical guide will help you to get started with creating, debugging, and deploying your Node.js applications and cover solutions to common problems, along with tips to avoid pitfalls. You'll become familiar with the Node.js development model by learning how to handle files and build simple web applications and then explore established and emerging Node.js web frameworks such as Express.js and Fastify. As you advance, you'll discover techniques for detecting problems in your applications, handling security concerns, and deploying your applications to the cloud. This recipe-based guide will help you to easily navigate through various core topics of server-side web application development with Node.js.",
        "image": "/jsbook3.jpg",
        "tags": [
            "JS",
            "learning",
            "education",
            "2022",
            "programming",
            "IT"
        ],
        "price": {
            "amount": 30,
            "currency": "EUR"
        }
    }
]
